posts/2015-11-22-prayer-for-my-pettiness.org
#+date: <2015-11-22>
#+filetags: prayer religion
#+title: Prayer for My Pettiness

Father,

I'm surrounded by voices\\
telling me what I want to hear,\\
voices urging me to seek my own good,\\
to protect what is mine,\\
that my security is more important\\
than the needs of others.

Help me, Lord,\\
to hear a different message,\\
one that challenges me\\
to become something\\
better than I have been,\\
and to dismantle my own petty kingdom\\
for the sake of the Kingdom of God.

/Amen/


#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]] [[file:../tags/religion.org][Religion]]
#+end_tagline
