docs/posts/2015-11-22-prayer-for-my-pettiness.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 14, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for My Pettiness</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for My Pettiness</h1>
<p class="subtitle" role="doc-subtitle">Nov 22, 2015</p>
</header><p>
Father,
</p>

<p>
I&rsquo;m surrounded by voices<br>
telling me what I want to hear,<br>
voices urging me to seek my own good,<br>
to protect what is mine,<br>
that my security is more important<br>
than the needs of others.
</p>

<p>
Help me, Lord,<br>
to hear a different message,<br>
one that challenges me<br>
to become something<br>
better than I have been,<br>
and to dismantle my own petty kingdom<br>
for the sake of the Kingdom of God.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 14, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
